In [1]:
#importing Libraries
import pandas as pd
import numpy as np

In [3]:
#https://www.kaggle.com/datasets/forgetabhi/top-10000-books-good-reads-dataset?resource=download
data_frame = pd.read_csv('books.csv')

In [9]:
#Getting Head and tail of data
data_frame.head(2)

,bookTitle,authorName,average_rating,num_ratings
0,"The Hunger Games (The Hunger Games, #1)",Suzanne Collins,4.34,"8,693,386"
1,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling,4.50,"3,393,240"

In [8]:
data_frame.tail(2)

,bookTitle,authorName,average_rating,num_ratings
9998,The Heights of Perdition (The Divine Space Pir...,C.S. Johnson,4.10,113
9999,The Timingila,Shon Mehta,4.24,25

In [11]:
#getting information of data set like number of entries, columns etc.
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   bookTitle       10000 non-null  object
 1   authorName      10000 non-null  object
 2   average_rating  9996 non-null   float64
 3   num_ratings     9996 non-null   object
dtypes: float64(1), object(3)
memory usage: 312.6+ KB

In [12]:
#getting statistical information related to data
data_frame.describe()

       average_rating
count     9996.000000
mean         4.052615
std          0.314170
min          0.000000
25%          3.890000
50%          4.070000
75%          4.240000
max          5.000000

In [13]:
#checking for missing values
data_frame.isnull()

      bookTitle  authorName  average_rating  num_ratings
0         False       False           False        False
1         False       False           False        False
2         False       False           False        False
3         False       False           False        False
4         False       False           False        False
...         ...         ...             ...          ...
9995      False       False           False        False
9996      False       False           False        False
9997      False       False           False        False
9998      False       False           False        False
9999      False       False           False        False

[10000 rows x 4 columns]

In [14]:
#Summing up the missing vales
data_frame.isnull().sum()

bookTitle         0
authorName        0
average_rating    4
num_ratings       4
dtype: int64

In [16]:
#Checking out column names and their data types
data_frame.dtypes

bookTitle          object
authorName         object
average_rating    float64
num_ratings        object
dtype: object

In [19]:
#Checking Dimensions i.e no of rows and columns of dataframe
dimensions = data_frame.shape
print("\nDimensions of DataFrame:")
print("Rows:", dimensions[0])
print("Columns:", dimensions[1])

Dimensions of DataFrame:
Rows: 10000
Columns: 4

In [32]:
#Lable encoding converting catagorical data into numerical data
from sklearn.preprocessing import LabelEncoder

# Initialize LabelEncoder
label_encoder = LabelEncoder()

# Encode the categorical column
data_frame['num_ratings'] = label_encoder.fit_transform(data_frame['num_ratings'])

In [33]:
data_frame.dtypes

bookTitle          object
authorName         object
average_rating    float64
num_ratings         int64
dtype: object

In [34]:
# converting int into float
data_frame['num_ratings']=data_frame['num_ratings'].astype(float)
data_frame.dtypes

bookTitle          object
authorName         object
average_rating    float64
num_ratings       float64
dtype: object

In [35]:
#converting float into category
data_frame['average_rating']=data_frame['average_rating'].astype('category')
data_frame.dtypes

bookTitle           object
authorName          object
average_rating    category
num_ratings        float64
dtype: object

In [36]:
#converting category into float
data_frame['average_rating']=data_frame['average_rating'].astype(float)
data_frame.dtypes

bookTitle          object
authorName         object
average_rating    float64
num_ratings       float64
dtype: object